ЖКХ/src/Documents/УчетПоказаний/УчетПоказаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетПоказаний</name>
  <registerRecords>InformationRegister.Показания</registerRecords>
  <registerRecords>AccumulationRegister.ПотреблениеРесурсов</registerRecords>
  <attributes>
    <name>Недвижимость</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показания</name>
    <attributes>
      <name>ПриборУчета</name>
      <type>
        <types>CatalogRef.ПриборыУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеУслуги</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖКХ/src/InformationRegisters/Показания/Показания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Показания</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Показание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Недвижимость</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриборУчета</name>
    <type>
      <types>CatalogRef.ПриборыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖКХ/src/AccumulationRegisters/ПотреблениеРесурсов/ПотреблениеРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотреблениеРесурсов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПотреблениеРесурса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПриборУчета</name>
    <type>
      <types>CatalogRef.ПриборыУчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЖКХ/src/Documents/УчетПоказаний/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Показания
	Движения.Показания.Записывать = Истина;
	
	Для Каждого ТекСтрокаПоказания Из Показания Цикл
		Движение = Движения.Показания.Добавить();
		Движение.Период = Дата;
		Движение.Недвижимость = Недвижимость;
		Движение.ПриборУчета = ТекСтрокаПоказания.ПриборУчета;
		Движение.Ресурс = ТекСтрокаПоказания.ПриборУчета.ВидРесурса;
		Движение.Показание = ТекСтрокаПоказания.ЗначениеУслуги;
	КонецЦикла;
	
	// регистр ПотреблениеРесурсов
	Движения.ПотреблениеРесурсов.Записывать = Истина;
	ВодоотведениеПотребление = 0;
	
	Для Каждого ТекСтрокаПотреблениеРесурсов Из Показания Цикл
		Движение = Движения.ПотреблениеРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.ПриборУчета = ТекСтрокаПотреблениеРесурсов.ПриборУчета;
		
		ПредыдущееЗначениеУслуги = ПолучитьПредыдущееЗначениеУслуги(ТекСтрокаПотреблениеРесурсов.ПриборУчета, Дата);
		
		Если ПредыдущееЗначениеУслуги = Неопределено Тогда
			
			Движение.ПотреблениеРесурса = 0;
			
		Иначе
			
			Движение.ПотреблениеРесурса = ТекСтрокаПотреблениеРесурсов.ЗначениеУслуги - ПредыдущееЗначениеУслуги;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПредыдущееЗначениеУслуги(Прибор, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказанияСрезПоследних.Показание КАК Показание
	|ИЗ
	|	РегистрСведений.Показания.СрезПоследних(ДобавитьКДате(&Дата, МЕСЯЦ, -1), ПриборУчета = &ПриборУчета) КАК ПоказанияСрезПоследних";
	
	// Установка значений параметров
	Запрос.УстановитьПараметр("ПриборУчета", Прибор);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат РезультатЗапроса[0].Показание;
		
	КонецЕсли;
	
КонецФункции
